# Ramadan Abdunabi
## Week13 & 14: 04/17/2025 - 04/22/2025
### Python - Pandas DataFrame Processing

In [1]:
import numpy as np
import pandas as pd
from pandas import *

In [2]:
#Drop entries
df = DataFrame(np.arange(16).reshape((4,4)),
               index=['Ohio', 'Colorado', 'Utah', 'New York'],
               columns=['one', 'two', 'three', 'four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [3]:
df.index

Index(['Ohio', 'Colorado', 'Utah', 'New York'], dtype='object')

In [4]:
df.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [5]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [6]:
df2 = df.copy()
df2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [7]:
df.drop(['Colorado'])

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [9]:
df.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [10]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
df.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [13]:
df.drop(['Utah'],axis =0)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York   12   13     14    15

In [14]:
df.drop(['one', 'four'], axis= "columns")

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [15]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
df.drop(['one', 'four'], axis= "columns", inplace=True)

In [18]:
df

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [19]:
df2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
df > 15

            two  three
Ohio      False  False
Colorado  False  False
Utah      False  False
New York  False  False

In [21]:
df2 > 15

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [22]:
df2 > 5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [24]:
df2[df2 > 5]

           one   two  three  four
Ohio       NaN   NaN    NaN   NaN
Colorado   NaN   NaN    6.0   7.0
Utah       8.0   9.0   10.0  11.0
New York  12.0  13.0   14.0  15.0

In [25]:
df2.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [26]:
df2.loc['Colorado', ['one','four']]

one     4
four    7
Name: Colorado, dtype: int32

In [28]:
# using iloc
df2.iloc[0]

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [29]:
df2.iloc[0,[3,1]]

four    3
two     1
Name: Ohio, dtype: int32

In [30]:
df2.iloc[1,:2]

one    4
two    5
Name: Colorado, dtype: int32

In [31]:
df2.iloc[[1,3],:2]

          one  two
Colorado    4    5
New York   12   13

In [34]:
df2.iloc[[1,3],[3,1]]

          four  two
Colorado     7    5
New York    15   13

In [35]:
df1 = DataFrame(np.arange(9).reshape((3,3)),
                columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [36]:
df2 = DataFrame(np.arange(12).reshape((4,3)),
                columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [37]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [39]:
df1.add(df2, fill_value=0) # fill the nan + number with 0 + number

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [40]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [41]:
df1['e'] = df1['b'] + df1['d']
df1

          b  c  d   e
Ohio      0  1  2   2
Texas     3  4  5   8
Colorado  6  7  8  14

In [42]:
#Operation between DataFrame and Series
s = df2.iloc[0]
s

b    0
d    1
e    2
Name: Utah, dtype: int32

In [43]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [44]:
df2 + s

        b   d   e
Utah    0   2   4
Ohio    3   5   7
Texas   6   8  10
Oregon  9  11  13

In [45]:
df2 - s

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [46]:
#sort and rank
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [47]:
df2.sort_index()

        b   d   e
Ohio    3   4   5
Oregon  9  10  11
Texas   6   7   8
Utah    0   1   2

In [48]:
df2.sort_index(axis=1)

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [49]:
df2.sort_index(axis=1, ascending=False)

         e   d  b
Utah     2   1  0
Ohio     5   4  3
Texas    8   7  6
Oregon  11  10  9

In [50]:
df2.sort_index(axis=0, ascending=False)

        b   d   e
Utah    0   1   2
Texas   6   7   8
Oregon  9  10  11
Ohio    3   4   5

In [2]:
# Sort by values
df = DataFrame({'b':[4,7,-3,-5], 'a':[0,-1,3,2]}, 
               index = ['one','three','four','two'])
df

       b  a
one    4  0
three  7 -1
four  -3  3
two   -5  2

In [3]:
#Sort data by columns 'b'
df.sort_values(by='b')

       b  a
two   -5  2
four  -3  3
one    4  0
three  7 -1

In [4]:
#Sort data by columns 'a', b'
df.sort_values(by=['a','b'])

       b  a
three  7 -1
one    4  0
two   -5  2
four  -3  3

In [5]:
df.sort_values(by='one', axis=1)

       a  b
one    0  4
three -1  7
four   3 -3
two    2 -5

In [6]:
df

       b  a
one    4  0
three  7 -1
four  -3  3
two   -5  2

In [7]:
df.sort_values(by='three', axis=1)

       a  b
one    0  4
three -1  7
four   3 -3
two    2 -5

In [8]:
df.sort_values(by=['four','three'], axis=1)

       b  a
one    4  0
three  7 -1
four  -3  3
two   -5  2

In [9]:
#ranking
df = DataFrame({'b':[14,17,-13,12], 'a':[10,11,15,11]})
df

    b   a
0  14  10
1  17  11
2 -13  15
3  12  11

In [10]:
df.rank()

     b    a
0  3.0  1.0
1  4.0  2.5
2  1.0  4.0
3  2.0  2.5

In [11]:
df.rank().astype(int)

   b  a
0  3  1
1  4  2
2  1  4
3  2  2

In [12]:
df

    b   a
0  14  10
1  17  11
2 -13  15
3  12  11

In [13]:
#Summarizing Data - Statistics 
df = DataFrame([ [1.4,np.nan], [7.1,-4.5], [np.nan,np.nan], [0.75,-1.3] ],
                 index = list('abcd'),
                 columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      float64
 1   two     2 non-null      float64
dtypes: float64(2)
memory usage: 96.0+ bytes

In [15]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [16]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [17]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [18]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [19]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [20]:
df.mean()[0]

3.0833333333333335

In [21]:
df.mean()[1]

-2.9

In [22]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [23]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [24]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [25]:
df.min()

one    0.75
two   -4.50
dtype: float64

In [26]:
df.max()

one    7.1
two   -1.3
dtype: float64

In [27]:
df.min(axis=1)

a    1.4
b   -4.5
c    NaN
d   -1.3
dtype: float64

In [28]:
df.max(axis=1)

a    1.40
b    7.10
c     NaN
d    0.75
dtype: float64

In [29]:
df['one'].max()

7.1

In [30]:
df['two'].mean()

-2.9

In [31]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [32]:
# idxmax() return index of first occurrence of maximum over requested axis
df.idxmax()

one    b
two    d
dtype: object

In [33]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [34]:
df.idxmin()

one    d
two    b
dtype: object

In [35]:
df.idxmin(axis=1)

a    one
b    two
c    NaN
d    two
dtype: object

In [36]:
data = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04'],
    'META': [150, 155, 148, 160],
    'TSLA': [200, 210, 195, 220],
    'GOOGL': [100, 105, 98, 110]
}

df = DataFrame(data)
df

         Date  META  TSLA  GOOGL
0  2023-01-01   150   200    100
1  2023-01-02   155   210    105
2  2023-01-03   148   195     98
3  2023-01-04   160   220    110

In [37]:
df.set_index('Date', inplace=True)
df

            META  TSLA  GOOGL
Date
2023-01-01   150   200    100
2023-01-02   155   210    105
2023-01-03   148   195     98
2023-01-04   160   220    110

In [38]:
# Find the date with the highest closing price for each stock
df.idxmax()

META     2023-01-04
TSLA     2023-01-04
GOOGL    2023-01-04
dtype: object

In [39]:
df.idxmin()

META     2023-01-03
TSLA     2023-01-03
GOOGL    2023-01-03
dtype: object

In [40]:
df.idxmax(axis=1)

Date
2023-01-01    TSLA
2023-01-02    TSLA
2023-01-03    TSLA
2023-01-04    TSLA
dtype: object

In [41]:
df.idxmin(axis=1)

Date
2023-01-01    GOOGL
2023-01-02    GOOGL
2023-01-03    GOOGL
2023-01-04    GOOGL
dtype: object

In [43]:
df_t = df.T
df_t

Date   2023-01-01  2023-01-02  2023-01-03  2023-01-04
META          150         155         148         160
TSLA          200         210         195         220
GOOGL         100         105          98         110

In [44]:
# Find the stock of the with minimum and maximum values 
# for a specific date: "2023-01-02"

df_t["2023-01-02"].idxmax()

'TSLA'

In [45]:
df_t["2023-01-02"].idxmin()

'GOOGL'

In [48]:
max_stock_index = df_t["2023-01-02"].idxmax()
print(f'Stock name with maximum value in 2023-01-02: {max_stock_index}')

Stock name with maximum value in 2023-01-02: TSLA

In [50]:
data = {
    "city": ["New York", "Los Angeles", "Chicago", "Houston"],
    "temperature": [20, 25, 18, 28],
    "humidity": [60, 40, 70, 50]
}

df = pd.DataFrame(data)
df

          city  temperature  humidity
0     New York           20        60
1  Los Angeles           25        40
2      Chicago           18        70
3      Houston           28        50

In [51]:
df.set_index('city', inplace=True)
df

             temperature  humidity
city
New York              20        60
Los Angeles           25        40
Chicago               18        70
Houston               28        50

In [52]:
df["temperature"].idxmin()

'Chicago'

In [53]:
df["humidity"].idxmin()

'Los Angeles'

In [54]:
df.loc[df["temperature"].idxmin()]

temperature    18
humidity       70
Name: Chicago, dtype: int64

In [55]:
min_temp_index = df["temperature"].idxmin()
df.loc[min_temp_index]

temperature    18
humidity       70
Name: Chicago, dtype: int64

In [56]:
df.loc['Chicago']

temperature    18
humidity       70
Name: Chicago, dtype: int64

In [57]:
# missing data
df = DataFrame([   [1,2,3,4],  [np.nan,5,6], [7,np.nan,9],  [np.nan,np.nan,np.nan]])
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [58]:
df.dropna()

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [59]:
df.dropna(how='all') # in the case of all NaN values only

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN

In [60]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [61]:
df.dropna(how='all',axis=1)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [62]:
df.dropna(how='any',axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [63]:
df.dropna()

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [64]:
df.dropna(thresh=2) #Keep only the rows having 2 or more valid data

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN

In [65]:
df.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [66]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [67]:
df.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.0  6.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [68]:
df.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  5.0  6.0  1.0
2  7.0  1.0  9.0  1.0
3  1.0  1.0  1.0  1.0

In [69]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [70]:
df.fillna(0, inplace=True)

In [71]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.0  6.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [72]:
df = pd.DataFrame({'A': [1, 2, np.nan, 4, np.nan, 6]})

df

     A
0  1.0
1  2.0
2  NaN
3  4.0
4  NaN
5  6.0

In [73]:
# Fill NaN values with the previous non-null value
df.fillna(method='ffill')

     A
0  1.0
1  2.0
2  2.0
3  4.0
4  4.0
5  6.0

In [74]:
df

     A
0  1.0
1  2.0
2  NaN
3  4.0
4  NaN
5  6.0

In [76]:
m = df['A'].mean()
m

3.25

In [77]:
df.fillna(m)

      A
0  1.00
1  2.00
2  3.25
3  4.00
4  3.25
5  6.00

In [78]:
df['A'].fillna(m, inplace=True)

0    1.00
1    2.00
2    3.25
3    4.00
4    3.25
5    6.00
Name: A, dtype: float64

In [79]:
df['A'].fillna(m, inplace=True)

In [80]:
df

      A
0  1.00
1  2.00
2  3.25
3  4.00
4  3.25
5  6.00

In [82]:
df['A'] = df['A'].astype(int)
df

   A
0  1
1  2
2  3
3  4
4  3
5  6

In [4]:
# value counts
df = DataFrame( {   'Qu1':[10,30,40,30,40],
                    'Qu2':[20,30,10,20,30],
                    'Qu3':[10,50,20,40,40]},
                     index=list('abcde')
)
df

   Qu1  Qu2  Qu3
a   10   20   10
b   30   30   50
c   40   10   20
d   30   20   40
e   40   30   40

In [5]:
df.columns

Index(['Qu1', 'Qu2', 'Qu3'], dtype='object')

In [6]:
df.values

array([[10, 20, 10],
       [30, 30, 50],
       [40, 10, 20],
       [30, 20, 40],
       [40, 30, 40]], dtype=int64)

In [7]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [8]:
df.describe()

             Qu1      Qu2        Qu3
count   5.000000   5.0000   5.000000
mean   30.000000  22.0000  32.000000
std    12.247449   8.3666  16.431677
min    10.000000  10.0000  10.000000
25%    30.000000  20.0000  20.000000
50%    30.000000  20.0000  40.000000
75%    40.000000  30.0000  40.000000
max    40.000000  30.0000  50.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Qu1     5 non-null      int64
 1   Qu2     5 non-null      int64
 2   Qu3     5 non-null      int64
dtypes: int64(3)
memory usage: 160.0+ bytes

In [10]:
df['Qu1'].value_counts()

30    2
40    2
10    1
Name: Qu1, dtype: int64

In [11]:
df['Qu3'].value_counts()

40    2
20    1
10    1
50    1
Name: Qu3, dtype: int64

In [12]:
df

   Qu1  Qu2  Qu3
a   10   20   10
b   30   30   50
c   40   10   20
d   30   20   40
e   40   30   40

In [13]:
df.loc['a'].value_counts()

10    2
20    1
Name: a, dtype: int64

In [14]:
df.loc['e'].value_counts()

40    2
30    1
Name: e, dtype: int64

In [15]:
# apply the value_counts method to the entire DataFrame
df.apply(pd.value_counts)

    Qu1  Qu2  Qu3
10  1.0  1.0  1.0
20  NaN  2.0  1.0
30  2.0  2.0  NaN
40  2.0  NaN  2.0
50  NaN  NaN  1.0

In [16]:
df.apply(pd.value_counts,axis=1)

    10   20   30   40   50
a  2.0  1.0  NaN  NaN  NaN
b  NaN  NaN  2.0  NaN  1.0
c  1.0  1.0  NaN  1.0  NaN
d  NaN  1.0  1.0  1.0  NaN
e  NaN  NaN  1.0  2.0  NaN

In [17]:
df

   Qu1  Qu2  Qu3
a   10   20   10
b   30   30   50
c   40   10   20
d   30   20   40
e   40   30   40

In [18]:
rs = df.apply(pd.value_counts)
rs

    Qu1  Qu2  Qu3
10  1.0  1.0  1.0
20  NaN  2.0  1.0
30  2.0  2.0  NaN
40  2.0  NaN  2.0
50  NaN  NaN  1.0

In [19]:
rs.fillna(0)

    Qu1  Qu2  Qu3
10  1.0  1.0  1.0
20  0.0  2.0  1.0
30  2.0  2.0  0.0
40  2.0  0.0  2.0
50  0.0  0.0  1.0

In [21]:
rs = rs.fillna(0).astype(int)
rs

    Qu1  Qu2  Qu3
10    1    1    1
20    0    2    1
30    2    2    0
40    2    0    2
50    0    0    1

In [22]:
rs.index.name = 'values'
rs

        Qu1  Qu2  Qu3
values
10        1    1    1
20        0    2    1
30        2    2    0
40        2    0    2
50        0    0    1

In [23]:
rs.columns.name = 'questions'

In [24]:
rs

questions  Qu1  Qu2  Qu3
values
10           1    1    1
20           0    2    1
30           2    2    0
40           2    0    2
50           0    0    1

In [25]:
data = {'Order ID': [1001, 2001, 3001, 4001, 5001],
        'Product': ['T-shirt', 'Hoodie', 'T-shirt', 'Mug', 'Hoodie']}

data

{'Order ID': [1001, 2001, 3001, 4001, 5001],
 'Product': ['T-shirt', 'Hoodie', 'T-shirt', 'Mug', 'Hoodie']}

In [26]:
df = DataFrame(data)
df

   Order ID  Product
0      1001  T-shirt
1      2001   Hoodie
2      3001  T-shirt
3      4001      Mug
4      5001   Hoodie

In [27]:
# Count the occurrences of each product
product_counts = df['Product'].value_counts()
product_counts

T-shirt    2
Hoodie     2
Mug        1
Name: Product, dtype: int64